ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_wdt0_regs.xml
<module id="HSM_WDT0" HW_revision="" description="HSM WDT0 Registers">
	<register id="RTIGCTRL" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="CNT0EN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CNT1EN" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COS" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="NTUSEL" description="" begin="19" end="16" width="4" rwaccess="RW"/>
	</register>
	<register id="RTITBCTRL" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="TBEXT" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INC" description="" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="RTICAPCTRL" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="CAPCNTR0" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CAPCNTR1" description="" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="RTICOMPCTRL" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="COMP0SEL" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMP1SEL" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="COMP2SEL" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="COMP3SEL" description="" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="RTIFRC0" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="FRC0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIUC0" width="32" page="0" offset="20" internal="0" description="">
		<bitfield id="UC0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICPUC0" width="32" page="0" offset="24" internal="0" description="">
		<bitfield id="CPUC0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICAFRC0" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="CAFRC0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICAUC0" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="CAUC0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIFRC1" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="FRC1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIUC1" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="UC1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICPUC1" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="CPUC1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICAFRC1" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="CAFRC1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICAUC1" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="CAUC1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICOMP0" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="COMP0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIUDCP0" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="UDCP0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICOMP1" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="COMP1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIUDCP1" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="UDCP1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICOMP2" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="COMP2" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIUDCP2" width="32" page="0" offset="100" internal="0" description="">
		<bitfield id="UDCP2" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICOMP3" width="32" page="0" offset="104" internal="0" description="">
		<bitfield id="COMP3" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIUDCP3" width="32" page="0" offset="108" internal="0" description="">
		<bitfield id="UDCP3" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTITBLCOMP" width="32" page="0" offset="112" internal="0" description="">
		<bitfield id="TBLCOMP" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTITBHCOMP" width="32" page="0" offset="116" internal="0" description="">
		<bitfield id="TBHCOMP" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTISETINT" width="32" page="0" offset="128" internal="0" description="">
		<bitfield id="SETINT0" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SETINT1" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SETINT2" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SETINT3" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SETDMA0" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SETDMA1" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SETDMA2" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SETDMA3" description="" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SETTBINT" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SETOVL0INT" description="" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SETOVL1INT" description="" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="RTICLEARINT" width="32" page="0" offset="132" internal="0" description="">
		<bitfield id="CLEARINT0" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLEARINT1" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLEARINT2" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLEARINT3" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLEARDMA0" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLEARDMA1" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLEARDMA2" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CLEARDMA3" description="" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CLEARTBINT" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLEAROVL0INT" description="" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLEAROVL1INT" description="" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="RTIINTFLAG" width="32" page="0" offset="136" internal="0" description="">
		<bitfield id="INT0" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INT1" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INT2" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INT3" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TBINT" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="OVL0INT" description="" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="OVL1INT" description="" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="RTIDWDCTRL" width="32" page="0" offset="144" internal="0" description="">
		<bitfield id="DWDCTRL" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIDWDPRLD" width="32" page="0" offset="148" internal="0" description="">
		<bitfield id="DWDPRLD" description="" begin="11" end="0" width="12" rwaccess="RW"/>
	</register>
	<register id="RTIWDSTATUS" width="32" page="0" offset="152" internal="0" description="">
		<bitfield id="AWDST" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DWDST" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEYST" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="STARTTIMEVIOL" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ENDTIMEVIOL" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DWWD_ST" description="" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="RTIWDKEY" width="32" page="0" offset="156" internal="0" description="">
		<bitfield id="WDKEY" description="" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="RTIDWDCNTR" width="32" page="0" offset="160" internal="0" description="">
		<bitfield id="DWDCNTR" description="" begin="24" end="0" width="25" rwaccess="RW"/>
	</register>
	<register id="RTIWWDRXNCTRL" width="32" page="0" offset="164" internal="0" description="">
		<bitfield id="WWDRXN" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="RTIWWDSIZECTRL" width="32" page="0" offset="168" internal="0" description="">
		<bitfield id="WWDSIZE" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTIINTCLRENABLE" width="32" page="0" offset="172" internal="0" description="">
		<bitfield id="INTCLRENABLE0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="INTCLRENABLE1" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="INTCLRENABLE2" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="INTCLRENABLE3" description="" begin="27" end="24" width="4" rwaccess="RW"/>
	</register>
	<register id="RTICOMP0CLR" width="32" page="0" offset="176" internal="0" description="">
		<bitfield id="COMP0CLR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICOMP1CLR" width="32" page="0" offset="180" internal="0" description="">
		<bitfield id="COMP1CLR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICOMP2CLR" width="32" page="0" offset="184" internal="0" description="">
		<bitfield id="COMP2CLR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="RTICOMP3CLR" width="32" page="0" offset="188" internal="0" description="">
		<bitfield id="COMP3CLR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
